Revit 2026 API

# ImporterIFCProcessIFCProject(IFCAnyHandle) Method

---

The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ProcessIFCProject(
	IFCAnyHandle ifcProject
)
```
```vb
Public Sub ProcessIFCProject (
	ifcProject As IFCAnyHandle
)
```
```cpp
public:
void ProcessIFCProject(
	IFCAnyHandle^ ifcProject
)
```
```fsharp
member ProcessIFCProject :
        ifcProject : IFCAnyHandle -> unit
```

#### Parameters

ifcProject IFCAnyHandle
     The IfcProject containing the entities in the IFC file.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ImporterIFC Class

ProcessIFCProject Overload

Autodesk.Revit.DB.IFC Namespace